In [1]:
import numpy as np
import pandas as pd

In [2]:
#PANDAS - Python for Data Analysis

In [3]:
#Series and Dataframes

In [4]:
s = pd.Series([2,3,4,5,7,np.nan,8,9])

In [5]:
s

0    2.0
1    3.0
2    4.0
3    5.0
4    7.0
5    NaN
6    8.0
7    9.0
dtype: float64

In [6]:
#Dataframe
#create a random normal distribution
# np.random.randn
arr = np.random.randn(6,4)
arr

array([[ 0.13893233,  1.57852887,  0.44561711, -0.58415162],
       [-1.59946507, -0.25476982, -1.0584373 ,  0.52300254],
       [-0.33668734,  0.76233911, -0.71321065, -0.44375579],
       [-1.80443341, -1.41749731, -2.24114063,  0.17025368],
       [-0.17332631,  1.63040803,  1.90881726, -1.80224646],
       [-0.79545817, -1.35267329, -1.09845486,  0.44562373]])

In [7]:
df = pd.DataFrame(arr)

In [8]:
df

          0         1         2         3
0  0.138932  1.578529  0.445617 -0.584152
1 -1.599465 -0.254770 -1.058437  0.523003
2 -0.336687  0.762339 -0.713211 -0.443756
3 -1.804433 -1.417497 -2.241141  0.170254
4 -0.173326  1.630408  1.908817 -1.802246
5 -0.795458 -1.352673 -1.098455  0.445624

In [9]:
#Create a date range 
dates = pd.date_range("20210201", periods=6)
dates

DatetimeIndex(['2021-02-01', '2021-02-02', '2021-02-03', '2021-02-04',
               '2021-02-05', '2021-02-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df2 = pd.DataFrame(arr, index=dates, columns=list('ABCD'))

In [11]:
df2

                   A         B         C         D
2021-02-01  0.138932  1.578529  0.445617 -0.584152
2021-02-02 -1.599465 -0.254770 -1.058437  0.523003
2021-02-03 -0.336687  0.762339 -0.713211 -0.443756
2021-02-04 -1.804433 -1.417497 -2.241141  0.170254
2021-02-05 -0.173326  1.630408  1.908817 -1.802246
2021-02-06 -0.795458 -1.352673 -1.098455  0.445624

In [12]:
import numpy as np
import pandas as pd
s2 = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
s2

a   -0.553552
b    0.528267
c   -3.013414
d   -0.681740
e   -0.578276
dtype: float64

In [13]:
s2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
#Creating a series with a python dictionary 
dict1 = {"name":"John", "age":30, "job":"analyst"}
dict1

{'name': 'John', 'age': 30, 'job': 'analyst'}

In [15]:
pd.Series(dict1)

name       John
age          30
job     analyst
dtype: object

In [16]:
#rearrange the indexing 
pd.Series(dict1, index=["age","job","D","name"])

age          30
job     analyst
D           NaN
name       John
dtype: object

In [17]:
#Dataframes
df2

                   A         B         C         D
2021-02-01  0.138932  1.578529  0.445617 -0.584152
2021-02-02 -1.599465 -0.254770 -1.058437  0.523003
2021-02-03 -0.336687  0.762339 -0.713211 -0.443756
2021-02-04 -1.804433 -1.417497 -2.241141  0.170254
2021-02-05 -0.173326  1.630408  1.908817 -1.802246
2021-02-06 -0.795458 -1.352673 -1.098455  0.445624

In [18]:
#view the first 5 rows or the last 5 rows
df2.head(2)

                   A         B         C         D
2021-02-01  0.138932  1.578529  0.445617 -0.584152
2021-02-02 -1.599465 -0.254770 -1.058437  0.523003

In [19]:
df2.tail() #gives the last 5 values in a dataset

                   A         B         C         D
2021-02-02 -1.599465 -0.254770 -1.058437  0.523003
2021-02-03 -0.336687  0.762339 -0.713211 -0.443756
2021-02-04 -1.804433 -1.417497 -2.241141  0.170254
2021-02-05 -0.173326  1.630408  1.908817 -1.802246
2021-02-06 -0.795458 -1.352673 -1.098455  0.445624

In [57]:
#display the column headers
df2.columns

#display the index 
df2.index

DatetimeIndex(['2021-02-01', '2021-02-02', '2021-02-03', '2021-02-04',
               '2021-02-05', '2021-02-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df2.describe

<bound method NDFrame.describe of                    A         B         C         D
2021-02-01  0.138932  1.578529  0.445617 -0.584152
2021-02-02 -1.599465 -0.254770 -1.058437  0.523003
2021-02-03 -0.336687  0.762339 -0.713211 -0.443756
2021-02-04 -1.804433 -1.417497 -2.241141  0.170254
2021-02-05 -0.173326  1.630408  1.908817 -1.802246
2021-02-06 -0.795458 -1.352673 -1.098455  0.445624>

In [22]:
df2.T #to transpose your data

   2021-02-01  2021-02-02  2021-02-03  2021-02-04  2021-02-05  2021-02-06
A    0.138932   -1.599465   -0.336687   -1.804433   -0.173326   -0.795458
B    1.578529   -0.254770    0.762339   -1.417497    1.630408   -1.352673
C    0.445617   -1.058437   -0.713211   -2.241141    1.908817   -1.098455
D   -0.584152    0.523003   -0.443756    0.170254   -1.802246    0.445624

## Importing files from different sources using PANDAS

csv, excel, json files

In [23]:
#CSV files 
import numpy as np
import pandas as pd

## SYNTAX
## pd.read_csv(location of file, seperator)

In [24]:
dogs = pd.read_csv('datasets/new_dogs.csv', delimiter=",")

In [25]:
#Excel files 
pd.read_excel('datasets/transactions.xlsx')

   transaction_id  product_id  price
0            1001           1    5.95
1            1002           2    6.95
2            1003           3    7.95

In [26]:
#Json files : Javascript Object notation
coin_data = pd.read_json("https://api.coingecko.com/api/v3/coins/markets?vs_currency=ngn&order=market_cap_desc&per_page=100&page=1&sparkline=false")

In [27]:
coin_data.head(10)

,id,symbol,name,image,current_price,market_cap,market_cap_rank,fully_diluted_valuation,total_volume,high_24h,...,total_supply,max_supply,ath,ath_change_percentage,ath_date,atl,atl_change_percentage,atl_date,roi,last_updated
0,bitcoin,btc,Bitcoin,https://assets.coingecko.com/coins/images/1/la...,21198894.00,395014746101407,1,4.451768e+14,2.728354e+13,21717523.00,...,2.100000e+07,2.100000e+07,21717523.00,-2.38806,2021-02-19T12:42:17.862Z,4289706.00,394.18057,2020-10-15T09:39:31.080Z,None,2021-02-20T09:38:59.181Z
1,ethereum,eth,Ethereum,https://assets.coingecko.com/coins/images/279/...,766179.00,87916629830146,2,NaN,1.535273e+13,798601.00,...,NaN,NaN,798601.00,-4.12387,2021-02-19T12:37:45.732Z,138690.00,452.07038,2020-10-17T00:43:04.177Z,"{'times': 47.50065222933275, 'currency': 'btc'...",2021-02-20T09:39:51.789Z
2,binancecoin,bnb,Binance Coin,https://assets.coingecko.com/coins/images/825/...,112391.00,17368169901621,3,1.916642e+13,6.724524e+12,129515.00,...,1.705337e+08,1.705337e+08,129515.00,-13.19735,2021-02-19T23:41:54.286Z,9955.07,1029.30217,2020-11-04T15:50:12.093Z,None,2021-02-20T09:40:26.471Z
3,polkadot,dot,Polkadot,https://assets.coingecko.com/coins/images/1217...,14393.69,13929344509043,4,NaN,1.489259e+12,14996.56,...,1.045378e+09,NaN,14996.56,-4.03778,2021-02-20T07:08:09.320Z,1471.84,877.75582,2020-10-16T04:29:43.107Z,None,2021-02-20T09:41:32.212Z
4,tether,usdt,Tether,https://assets.coingecko.com/coins/images/325/...,382.54,13055683746842,5,NaN,4.702838e+13,412.26,...,3.412884e+10,NaN,414.19,-7.64096,2021-02-18T13:03:58.142Z,373.99,2.28778,2020-12-02T12:07:41.765Z,None,2021-02-20T09:10:20.235Z
5,cardano,ada,Cardano,https://assets.coingecko.com/coins/images/975/...,402.02,12833917657491,6,NaN,2.557495e+12,409.27,...,4.500000e+10,NaN,409.27,-2.98072,2021-02-20T06:42:22.832Z,34.17,1061.98402,2020-11-03T04:34:07.685Z,None,2021-02-20T09:38:08.459Z
6,ripple,xrp,XRP,https://assets.coingecko.com/coins/images/44/l...,216.28,9883769447398,7,NaN,2.313154e+12,236.82,...,1.000000e+11,NaN,293.89,-26.40873,2020-11-24T05:58:06.250Z,67.32,221.25116,2020-12-29T16:07:19.613Z,None,2021-02-20T09:37:59.210Z
7,litecoin,ltc,Litecoin,https://assets.coingecko.com/coins/images/2/la...,91363.00,6099093967910,8,NaN,3.498337e+12,96247.00,...,8.400000e+07,NaN,97195.00,-6.32952,2021-02-18T02:07:40.672Z,17716.59,413.88585,2020-10-16T04:29:13.800Z,None,2021-02-20T09:40:04.325Z
8,chainlink,link,Chainlink,https://assets.coingecko.com/coins/images/877/...,13253.61,5414226032326,9,1.325361e+13,1.021998e+12,14130.93,...,1.000000e+09,1.000000e+09,14130.93,-6.95186,2021-02-19T12:45:32.624Z,3528.04,272.68783,2020-12-23T22:28:40.835Z,None,2021-02-20T09:37:42.454Z
9,bitcoin-cash,bch,Bitcoin Cash,https://assets.coingecko.com/coins/images/780/...,277053.00,5169834686062,10,NaN,2.898380e+12,304211.00,...,2.100000e+07,NaN,304792.00,-9.47010,2021-02-16T03:28:04.712Z,89025.00,209.94326,2020-11-04T11:20:21.006Z,None,2021-02-20T09:37:45.861Z

## Writing data to files

In [28]:
dogs

     name      breed  height_cm  weight_kg       d_o_b
0  Ginger  Dachshund         22         10  2019-03-14
1   Scout  Dalmatian         59         25  2019-05-09
2  Marley   Alsasian         56         28  2020-04-08

In [29]:
new_dogs = dogs.copy()

In [30]:
new_dogs

     name      breed  height_cm  weight_kg       d_o_b
0  Ginger  Dachshund         22         10  2019-03-14
1   Scout  Dalmatian         59         25  2019-05-09
2  Marley   Alsasian         56         28  2020-04-08

In [31]:
new_dogs['name']

0    Ginger
1     Scout
2    Marley
Name: name, dtype: object

In [32]:
new_dogs.columns

Index(['name', 'breed', 'height_cm', 'weight_kg', 'd_o_b'], dtype='object')

## add data to this based on calculations 
## lets calculate the BMI's

In [33]:
new_dogs["bmi"] = (new_dogs["weight_kg"] / (new_dogs["height_cm"] / 100) ** 2)

In [34]:
new_dogs

     name      breed  height_cm  weight_kg       d_o_b         bmi
0  Ginger  Dachshund         22         10  2019-03-14  206.611570
1   Scout  Dalmatian         59         25  2019-05-09   71.818443
2  Marley   Alsasian         56         28  2020-04-08   89.285714

In [58]:
dogs

     name      breed  height_cm  weight_kg       d_o_b
0  Ginger  Dachshund         22         10  2019-03-14
1   Scout  Dalmatian         59         25  2019-05-09
2  Marley   Alsasian         56         28  2020-04-08

## to create a new csv with the updated data 
## use the to_csv method

In [35]:
new_dogs.to_csv('datasets/dogs_with_bmi.csv')

## Selecting specific columns from the dataset

In [36]:
coin_data.columns

Index(['id', 'symbol', 'name', 'image', 'current_price', 'market_cap',
       'market_cap_rank', 'fully_diluted_valuation', 'total_volume',
       'high_24h', 'low_24h', 'price_change_24h',
       'price_change_percentage_24h', 'market_cap_change_24h',
       'market_cap_change_percentage_24h', 'circulating_supply',
       'total_supply', 'max_supply', 'ath', 'ath_change_percentage',
       'ath_date', 'atl', 'atl_change_percentage', 'atl_date', 'roi',
       'last_updated'],
      dtype='object')

In [37]:
new_coin_data = pd.DataFrame(coin_data, columns=['symbol', 'name','current_price', 'high_24h', 'low_24h', 'price_change_percentage_24h'])

In [38]:
new_coin_data.head() #returns the last 5 rows

,symbol,name,current_price,high_24h,low_24h,price_change_percentage_24h
0,btc,Bitcoin,21198894.00,21717523.00,20091908.00,4.73487
1,eth,Ethereum,766179.00,798601.00,732519.00,2.94605
2,bnb,Binance Coin,112391.00,129515.00,97390.00,14.30497
3,dot,Polkadot,14393.69,14996.56,12373.55,14.43795
4,usdt,Tether,382.54,412.26,381.30,0.17134

## locating values in a dataset
Using loc and iloc

### loc() and iloc() are methods used in slicing of data from pandas DataFrame

In [39]:
new_coin_data.loc[0] 
#returns all content in the row with index 0

symbol                                 btc
name                               Bitcoin
current_price                  2.11989e+07
high_24h                       2.17175e+07
low_24h                        2.00919e+07
price_change_percentage_24h        4.73487
Name: 0, dtype: object

In [40]:
new_coin_data.iloc[0]

symbol                                 btc
name                               Bitcoin
current_price                  2.11989e+07
high_24h                       2.17175e+07
low_24h                        2.00919e+07
price_change_percentage_24h        4.73487
Name: 0, dtype: object

In [41]:
new_coin_data.iloc[1,2] #returns row index 1 and col index 2

766179.0

In [42]:
new_coin_data.iloc[:,1] #returns all the content in column index 1

0          Bitcoin
1         Ethereum
2     Binance Coin
3         Polkadot
4           Tether
          ...
95            Lisk
96      Ampleforth
97      Enjin Coin
98        TerraUSD
99            HUSD
Name: name, Length: 100, dtype: object

In [43]:
new_coin_data.iloc[10:15]

,symbol,name,current_price,high_24h,low_24h,price_change_percentage_24h
10,xlm,Stellar,198.28,213.97,192.25,1.29935
11,uni,Uniswap,10326.03,10467.93,7463.26,27.83402
12,usdc,USD Coin,382.81,413.15,378.81,0.06315
13,doge,Dogecoin,22.48,23.43,20.44,4.49566
14,wbtc,Wrapped Bitcoin,21220058.00,21737527.00,20030129.00,5.24844

In [44]:
new_coin_data.iloc[10:15, 2:5] 
#first arg represents the rows, 2nd arg reps the columns

    current_price     high_24h      low_24h
10         198.28       213.97       192.25
11       10326.03     10467.93      7463.26
12         382.81       413.15       378.81
13          22.48        23.43        20.44
14    21220058.00  21737527.00  20030129.00

In [45]:
new_coin_data.iloc[[2,3,5]]

,symbol,name,current_price,high_24h,low_24h,price_change_percentage_24h
2,bnb,Binance Coin,112391.00,129515.00,97390.00,14.30497
3,dot,Polkadot,14393.69,14996.56,12373.55,14.43795
5,ada,Cardano,402.02,409.27,349.41,12.96830

In [46]:
#specify the rows and columns to display
new_coin_data.iloc[[2,3,5], 1:4]

           name  current_price   high_24h
2  Binance Coin      112391.00  129515.00
3      Polkadot       14393.69   14996.56
5       Cardano         402.02     409.27

In [47]:
cars = pd.read_csv('datasets/cars.csv')

In [48]:
cars.head()

          Car       Model  Volume  Weight  CO2
0      Toyoty        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [49]:
#set the index values to the car column 
cars = cars.set_index('Car')

In [50]:
cars.head()

                 Model  Volume  Weight  CO2
Car
Toyoty            Aygo    1000     790   99
Mitsubishi  Space Star    1200    1160   95
Skoda           Citigo    1000     929   95
Fiat               500     900     865   90
Mini            Cooper    1500    1140  105

In [51]:
#slicing using loc or iloc
#iloc() is index based. requires an integer index ( to select specific 
# rows / columns )
#while loc can accept (strings and booleans for indexing)

In [52]:
cars.loc[['Opel']]

         Model  Volume  Weight  CO2
Car
Opel     Astra    1600    1330   97
Opel  Insignia    2000    1428   99
Opel    Zafira    1600    1405  109

In [53]:
cars.loc[['Mercedes']]

            Model  Volume  Weight  CO2
Car
Mercedes  A-Class    1500    1365   92
Mercedes  C-Class    2100    1365   99
Mercedes      CLA    1500    1465  102
Mercedes  E-Class    2100    1605  115
Mercedes      SLK    2500    1395  120

In [54]:
cars.loc[(cars.Volume < 2000)].head()

                 Model  Volume  Weight  CO2
Car
Toyoty            Aygo    1000     790   99
Mitsubishi  Space Star    1200    1160   95
Skoda           Citigo    1000     929   95
Fiat               500     900     865   90
Mini            Cooper    1500    1140  105

In [55]:
cars.loc[(cars.Model == 'E-Class') | (cars.Weight > 1000)].head() 
# | or operator returns true as long as one condition is true

                 Model  Volume  Weight  CO2
Car
Mitsubishi  Space Star    1200    1160   95
Mini            Cooper    1500    1140  105
Skoda            Fabia    1400    1109   90
Mercedes       A-Class    1500    1365   92
Ford            Fiesta    1500    1112   98

In [56]:
cars.loc[(cars.Model == 'E-Class') & (cars.Weight > 1000)] 
# & and operator returns true as long as both conditions are true

            Model  Volume  Weight  CO2
Car
Mercedes  E-Class    2100    1605  115